## Terraform Prod Infra Plan

#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>
terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/gitops-learn/prod/runs/run-xgK38xarUknRHPBD

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.availability_zones: Reading...
module.eks.module.eks.data.aws_partition.current: Reading...
data.aws_elb_hosted_zone_id.main: Reading...
module.eks.module.eks.module.eks_managed_node_group["system"].data.aws_partition.current: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["app"].data.aws_partition.current: Reading...
module.networking.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09be362556c633a8e]
module.eks.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_elb_hosted_zone_id.main: Read complete after 0s [id=Z35SXDOTRQ7X7K]
module.eks.module.eks.module.eks_managed_node_group["app"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.eks_managed_node_group["system"].data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks_kms.aws_kms_key.default: Refreshing state... [id=165a1d84-1bd0-4beb-85d5-dacb6c177b09]
module.eks.module.eks.module.eks_managed_node_group["app"].data.aws_caller_identity.current: Reading...
data.aws_route53_zone.domain: Reading...
module.eks.module.eks.module.eks_managed_node_group["system"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/gitops-learn-us-east-1-prod/cluster]
module.eks.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=630104760403]
module.eks.module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=630104760403]
module.eks.module.eks.module.eks_managed_node_group["app"].data.aws_caller_identity.current: Read complete after 0s [id=630104760403]
module.eks.module.eks.module.eks_managed_node_group["system"].data.aws_caller_identity.current: Read complete after 0s [id=630104760403]
module.eks.module.eks.module.eks_managed_node_group["app"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["system"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=630104760403]
module.eks.module.eks.module.eks_managed_node_group["system"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.module.eks_managed_node_group["app"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_availability_zones.availability_zones: Read complete after 0s [id=us-east-1]
module.eks.module.eks.module.eks_managed_node_group["app"].aws_iam_role.this[0]: Refreshing state... [id=app-eks-node-group-20230207095234945000000001]
module.eks.module.eks.module.eks_managed_node_group["system"].aws_iam_role.this[0]: Refreshing state... [id=system-eks-node-group-20230207095234945900000002]
module.networking.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cd8e89e56271daf1]
module.eks_kms.aws_kms_alias.default: Refreshing state... [id=alias/eks1]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=gitops-learn-us-east-1-prod-cluster-20230207100655903100000001]
module.networking.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02d534bdef9ee72ed]
module.networking.module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-05b12f2c3e3349b01]
module.networking.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-011e0857a01bf10df]
module.networking.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08f9e8f295e9ffaac]
module.networking.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0d4ff18eb7f80ddb2]
module.networking.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-02b0594a079152877]
module.networking.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0e1fc8941b46f1b77]
module.networking.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0e9492ddb171d3078]
module.eks.module.eks.module.eks_managed_node_group["app"].aws_security_group.this[0]: Refreshing state... [id=sg-0161afeec9b2544cf]
module.eks.module.eks.module.eks_managed_node_group["system"].aws_security_group.this[0]: Refreshing state... [id=sg-0fb612d0c52f58e56]
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ea235057ac09bda6]
module.networking.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06b809003bc61d72d]
module.networking.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ce92fd27b809a7a1]
data.aws_route53_zone.domain: Read complete after 1s [id=Z03615011U2C8LAWZDOGP]
module.networking.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0d2981d726a493909]
module.networking.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-013a4a2027e12a554]
module.networking.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0815ae9f8f72dc641]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0781a5bd2b48a643b]
module.eks.module.eks.module.eks_managed_node_group["app"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=app-eks-node-group-20230207095234945000000001-20230207095235651400000007]
module.eks.module.eks.module.eks_managed_node_group["app"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=app-eks-node-group-20230207095234945000000001-20230207095235653700000008]
module.eks.module.eks.module.eks_managed_node_group["app"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=app-eks-node-group-20230207095234945000000001-20230207095235650600000006]
module.eks.module.eks.module.eks_managed_node_group["system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=system-eks-node-group-20230207095234945900000002-20230207095235553300000005]
module.eks.module.eks.module.eks_managed_node_group["system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=system-eks-node-group-20230207095234945900000002-20230207095235539500000003]
module.eks.module.eks.module.eks_managed_node_group["system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=system-eks-node-group-20230207095234945900000002-20230207095235545300000004]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=gitops-learn-us-east-1-prod-cluster-20230207100655903100000001-20230207100656533700000003]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=gitops-learn-us-east-1-prod-cluster-20230207100655903100000001-20230207100656524500000002]
module.networking.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=gitops-learn-us-east-1-prod-vpc]
module.networking.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-08da3b8f4e76325e6]
module.networking.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-02514328d77438296]
module.networking.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0c2f77d4722f41ca0]
module.networking.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-07ee4faf9eeff72c0]
module.networking.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0815ae9f8f72dc6411080289494]
module.networking.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f2db4a6a0df1ad09]
module.networking.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0e3af55273bd2fcc0]
module.networking.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0f32c23a468e9ec02]
module.networking.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b1101e6bd5e40079]
module.networking.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07ada6a51652b5dde]
module.networking.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0fc4b8123861cae9e]
module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-1438366873]
module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-3117492800]
module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2528136522]
module.eks.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::630104760403:policy/gitops-learn-us-east-1-prod-cluster-ClusterEncryption20230207095244184000000009]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4016122592]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1738288869]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-3145520764]
module.eks.module.eks.aws_security_group_rule.node["ingress_nodes_karpenter_ports_tcp"]: Refreshing state... [id=sgrule-2770028354]
module.eks.module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1430614153]
module.eks.module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-4286707205]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1262389519]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4077261981]
module.eks.module.eks.aws_security_group_rule.node["ingress_allow_access_from_control_plane"]: Refreshing state... [id=sgrule-3250222217]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-980002351]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-3319985009]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3020825673]
module.eks.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-440192623]
module.networking.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06b809003bc61d72d1080289494]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=gitops-learn-us-east-1-prod-cluster-20230207100655903100000001-20230207100656544500000004]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=gitops-learn-us-east-1-prod]
module.generic_sg_egress.aws_security_group.security_group: Refreshing state... [id=sg-07ffaf7b2a93fa61f]
module.pgsql_sg_ingress.aws_security_group.security_group: Refreshing state... [id=sg-05473fbfa84ddd53c]
module.pgsql.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=gitops-learn-us-east-1-prod-pgsql-2023020709544292970000000e]
module.pgsql.random_password.master_password[0]: Refreshing state... [id=none]
module.pgsql.module.db_instance.data.aws_partition.current: Reading...
module.pgsql.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.pgsql.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.pgsql.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.generic_sg_egress.aws_security_group_rule.security_group_rule: Refreshing state... [id=sgrule-2971857267]
module.pgsql_sg_ingress.aws_security_group_rule.security_group_rule: Refreshing state... [id=sgrule-138323470]
module.eks.module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-06e918cf0912a2c44,Environment]
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["terraform-managed"]: Refreshing state... [id=sg-06e918cf0912a2c44,terraform-managed]
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["karpenter.sh/discovery"]: Refreshing state... [id=sg-06e918cf0912a2c44,karpenter.sh/discovery]
module.eks.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=2023-02-07 14:45:06.447314707 +0000 UTC]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::630104760403:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/E0EB08E5B4A17173E3578E9738E413CC]
data.kubectl_file_documents.fluentbit_yaml_count: Reading...
module.eks.module.eks.module.eks_managed_node_group["app"].aws_launch_template.this[0]: Refreshing state... [id=lt-0b8995efb784c996d]
data.kubectl_file_documents.csi_secrets: Reading...
module.eks.module.eks.module.eks_managed_node_group["system"].aws_launch_template.this[0]: Refreshing state... [id=lt-05570b9dded9f1aff]
module.pgsql.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=gitops-learn-us-east-1-prod-pgsql]
data.kubectl_file_documents.csi_secrets: Read complete after 0s [id=99068e74f7587d7a9960f5df5261eae287a84cb022d80706e0e72a621875c2ee]
data.kubectl_file_documents.fluentbit_yaml_count: Read complete after 0s [id=c2a122a4a8d24bc39c99c9bc43afc105f81be85386d5efd9b2908e1b8226e51e]
module.eks.module.eks.module.eks_managed_node_group["system"].aws_eks_node_group.this[0]: Refreshing state... [id=gitops-learn-us-east-1-prod:system-20230207101637484100000009]
module.eks.module.eks.module.eks_managed_node_group["app"].aws_eks_node_group.this[0]: Refreshing state... [id=gitops-learn-us-east-1-prod:app-2023020710163748450000000b]
module.awssm-db-password.aws_secretsmanager_secret.secret: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:630104760403:secret:dbpassword-F51aS1]
module.ssmw-db-endpoint.aws_ssm_parameter.ssm_parameter: Refreshing state... [id=/gitops-learn/database/db_endpoint_url]
module.awssm-db-password.aws_secretsmanager_secret_version.secret: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:630104760403:secret:dbpassword-F51aS1|7DDAD783-DF0D-4745-954C-E2979C72ADE9]
aws_iam_policy.secrets_policy: Refreshing state... [id=arn:aws:iam::630104760403:policy/secrets_policy]
module.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=gitops-learn-us-east-1-prod:coredns]
module.eks.module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=gitops-learn-us-east-1-prod:vpc-cni]
kubectl_manifest.aws_auth: Refreshing state... [id=/api/v1/namespaces/kube-system/configmaps/aws-auth]
module.alb_ingress.data.aws_iam_policy_document.aws-load-balancer-controller: Reading...
module.alb_ingress.aws_s3_bucket.alb_logs: Refreshing state... [id=pick-bazar-logs-s3-bucket-2]
module.alb_ingress.data.aws_caller_identity.current: Reading...
module.alb_ingress.data.aws_elb_service_account.main: Reading...
module.alb_ingress.data.aws_iam_policy_document.aws-load-balancer-controller: Read complete after 0s [id=2909577307]
module.karpenter.data.aws_iam_policy.ssm_managed_instance: Reading...
module.alb_ingress.data.aws_elb_service_account.main: Read complete after 0s [id=127311923021]
module.karpenter.data.aws_iam_policy_document.karpenter_assume_role: Reading...
module.karpenter.data.aws_iam_policy_document.karpenter_assume_role: Read complete after 0s [id=4214048556]
module.alb_ingress.data.aws_caller_identity.current: Read complete after 0s [id=630104760403]
module.alb_ingress.aws_iam_role.aws-load-balancer-controller: Refreshing state... [id=aws-load-balancer-controller]
module.alb_ingress.aws_s3_bucket_policy.allow_alb_logging: Refreshing state... [id=pick-bazar-logs-s3-bucket-2]
module.alb_ingress.aws_s3_bucket_acl.alb_logs_acl: Refreshing state... [id=pick-bazar-logs-s3-bucket-2,private]
module.alb_ingress.aws_iam_policy.alb_iam_policy: Refreshing state... [id=arn:aws:iam::630104760403:policy/AWSLoadBalancerControllerIAMPolicy]
module.alb_ingress.aws_iam_role_policy_attachment.aws-load-balancer-controller: Refreshing state... [id=aws-load-balancer-controller-20230207102704302000000001]
module.alb_ingress.helm_release.lbc: Refreshing state... [id=aws-load-balancer-controller]
module.karpenter.data.aws_iam_policy.ssm_managed_instance: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.logging.data.aws_caller_identity.current: Reading...
module.logging.data.aws_region.current: Reading...
kubernetes_namespace_v1.app: Refreshing state... [id=gitops-learn]
module.logging.data.aws_iam_policy_document.irsa_fluentbit: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_iam_policy_document.irsa_fluentbit: Read complete after 0s [id=1888319423]
module.logging.data.aws_caller_identity.current: Read complete after 0s [id=630104760403]
kubernetes_role_binding_v1.developer: Refreshing state... [id=gitops-learn/developer]
kubernetes_role_v1.readonly: Refreshing state... [id=gitops-learn/readonly]
kubernetes_role_binding_v1.readonly: Refreshing state... [id=gitops-learn/readonly]
kubernetes_role_v1.developer: Refreshing state... [id=gitops-learn/developer]
module.irsa_aws_secrets.data.aws_iam_policy_document.default: Reading...
module.csi-secrets-driver.helm_release.csi_secrets: Refreshing state... [id=csi-secrets-store]
module.irsa_aws_secrets.data.aws_iam_policy_document.default: Read complete after 0s [id=2407527819]
module.irsa_aws_secrets.aws_iam_role.default: Refreshing state... [id=irsa-aws-secrets]
module.acm.aws_acm_certificate.default: Refreshing state... [id=arn:aws:acm:us-east-1:630104760403:certificate/6d00a31d-2060-4efb-aa54-15f62d90aa42]
module.irsa_aws_secrets.aws_iam_role_policy_attachment.default: Refreshing state... [id=irsa-aws-secrets-2023020710200290010000000f]
kubernetes_service_account.irsa_aws_secrets: Refreshing state... [id=gitops-learn/irsa-aws-secrets]
module.csi-secrets-driver.data.kubectl_path_documents.csi_secrets: Reading...
module.csi-secrets-driver.data.kubectl_path_documents.csi_secrets: Read complete after 0s [id=bdea6a70710ac7b92e4407f4979ec41bd1179f46e575273210cf5aa4ee69beef]
module.csi-secrets-driver.kubectl_manifest.csi_secrets[3]: Refreshing state... [id=/apis/apps/v1/namespaces/kube-system/daemonsets/csi-secrets-store-provider-aws]
module.csi-secrets-driver.kubectl_manifest.csi_secrets[1]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/csi-secrets-store-provider-aws-cluster-role]
module.csi-secrets-driver.kubectl_manifest.csi_secrets[0]: Refreshing state... [id=/api/v1/namespaces/kube-system/serviceaccounts/csi-secrets-store-provider-aws]
module.csi-secrets-driver.kubectl_manifest.csi_secrets[2]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/csi-secrets-store-provider-aws-cluster-rolebinding]
kubectl_manifest.secrets: Refreshing state... [id=/apis/secrets-store.csi.x-k8s.io/v1alpha1/namespaces/gitops-learn/secretproviderclasses/aws-secret-application]
kubernetes_deployment_v1.backend: Refreshing state... [id=gitops-learn/gitops-learn-laravel]
module.acm.aws_route53_record.default["*.pick-bazar.store"]: Refreshing state... [id=Z03615011U2C8LAWZDOGP__3497bdec34155eea38bbf0decd73712a.pick-bazar.store._CNAME]
module.acm.aws_route53_record.default["pick-bazar.store"]: Refreshing state... [id=Z03615011U2C8LAWZDOGP__3497bdec34155eea38bbf0decd73712a.pick-bazar.store._CNAME]
kubernetes_service.backend: Refreshing state... [id=gitops-learn/gitops-learn-laravel]
kubernetes_deployment_v1.frontend: Refreshing state... [id=gitops-learn/gitops-learn-react]
kubernetes_service.frontend: Refreshing state... [id=gitops-learn/gitops-learn-react]
module.acm.aws_acm_certificate_validation.default: Refreshing state... [id=2023-02-07 10:27:59.014 +0000 UTC]
kubernetes_ingress_v1.app: Refreshing state... [id=gitops-learn/gitops-learn]
aws_route53_record.app: Refreshing state... [id=Z03615011U2C8LAWZDOGP_pick-bazar.store_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # kubernetes_deployment_v1.backend will be updated in-place
  ~ resource "kubernetes_deployment_v1" "backend" {
        id               = "gitops-learn/gitops-learn-laravel"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "quanganhquanganh/pick-bazar-laravel:b1ad68e7a78af3edd05a6d820545a7c2cf5c41c6-dev" -> "quanganhquanganh/pick-bazar-laravel:0f337b1aa3837ee93a322e3b980d1434fd14054f-dev"
                        name                       = "laravel"
                        # (8 unchanged attributes hidden)

                      ~ lifecycle {
                          ~ post_start {
                              ~ exec {
                                  ~ command = [
                                        # (1 unchanged element hidden)
                                        "-c",
                                      - "php artisan db:seed --force",
                                      + "php artisan db:wipe --force && php artisan db:seed --force",
                                    ]
                                }
                            }
                        }

                        # (11 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_deployment_v1.frontend will be updated in-place
  ~ resource "kubernetes_deployment_v1" "frontend" {
        id               = "gitops-learn/gitops-learn-react"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "quanganhquanganh/pick-bazar-frontend:b1ad68e7a78af3edd05a6d820545a7c2cf5c41c6-dev" -> "quanganhquanganh/pick-bazar-frontend:0f337b1aa3837ee93a322e3b980d1434fd14054f-dev"
                        name                       = "react"
                        # (8 unchanged attributes hidden)

                        # (3 unchanged blocks hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.karpenter.aws_iam_instance_profile.karpenter will be created
  + resource "aws_iam_instance_profile" "karpenter" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "KarpenterNodeInstanceProfile"
      + path        = "/"
      + role        = "app-eks-node-group-20230207095234945000000001"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.karpenter.aws_iam_policy.karpenter_policy will be created
  + resource "aws_iam_policy" "karpenter_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "karpenter_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                          + "ec2:RunInstances",
                          + "ec2:CreateTags",
                          + "iam:PassRole",
                          + "ec2:TerminateInstances",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeAvailabilityZones",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "KarpenterPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.karpenter.aws_iam_role.irsa_karpenter will be created
  + resource "aws_iam_role" "irsa_karpenter" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/E0EB08E5B4A17173E3578E9738E413CC:sub" = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::630104760403:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/E0EB08E5B4A17173E3578E9738E413CC"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "KarpenterRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.karpenter.aws_iam_role_policy_attachment.irsa_fluentbit will be created
  + resource "aws_iam_role_policy_attachment" "irsa_fluentbit" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "KarpenterRole"
    }

  # module.karpenter.aws_iam_role_policy_attachment.karpenter_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "karpenter_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "app-eks-node-group-20230207095234945000000001"
    }

  # module.karpenter.helm_release.karpenter will be created
  + resource "helm_release" "karpenter" {
      + atomic                     = false
      + chart                      = "karpenter"
      + cleanup_on_fail            = true
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "karpenter"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.karpenter.sh"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.6.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "aws.defaultInstanceProfile"
          + value = "KarpenterNodeInstanceProfile"
        }
      + set {
          + name  = "controller.clusterEndpoint"
          + value = "https://E0EB08E5B4A17173E3578E9738E413CC.gr7.us-east-1.eks.amazonaws.com"
        }
      + set {
          + name  = "controller.clusterName"
          + value = "gitops-learn-us-east-1-prod"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
    }

  # module.karpenter.kubectl_manifest.karpenter_provisioner will be created
  + resource "kubectl_manifest" "karpenter_provisioner" {
      + api_version             = "karpenter.sh/v1alpha5"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Provisioner"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1alpha5
            kind: Provisioner
            metadata:
              name: default
            spec:
              limits:
                resources:
                  cpu: 1000
              provider:
                instanceProfile: KarpenterNodeInstanceProfile
                securityGroupSelector:
                  karpenter.sh/discovery: gitops-learn-us-east-1-prod
                subnetSelector:
                  karpenter.sh/discovery: gitops-learn-us-east-1-prod
              requirements:
              - key: karpenter.sh/capacity-type
                operator: In
                values:
                - on-demand
              - key: node.kubernetes.io/instance-type
                operator: In
                values:
                - t3.small
                - t3.micro
              ttlSecondsAfterEmpty: 30
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.logging.data.kubectl_path_documents.fluentbit_yaml_parse will be read during apply
  # (config refers to values not yet known)
 <= data "kubectl_path_documents" "fluentbit_yaml_parse" {
      + documents = (known after apply)
      + id        = (known after apply)
      + manifests = (known after apply)
      + pattern   = "./modules/logging/fluentbit.yaml"
      + vars      = {
          + "aws_region"           = "us-east-1"
          + "es_endpoint"          = (known after apply)
          + "fb_version"           = "2.23.3"
          + "namespace"            = "logging"
          + "service_account_name" = "irsa-fluentbit"
        }
    }

  # module.logging.aws_elasticsearch_domain.es will be created
  + resource "aws_elasticsearch_domain" "es" {
      + access_policies       = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "es:ESHttp*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:es:us-east-1:630104760403:domain/eslogging/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + advanced_options      = (known after apply)
      + arn                   = (known after apply)
      + domain_id             = (known after apply)
      + domain_name           = "eslogging"
      + elasticsearch_version = "OpenSearch_1.2"
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + kibana_endpoint       = (known after apply)
      + tags                  = {
          + "Domain"            = "eslogging"
          + "Environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + tags_all              = {
          + "Domain"            = "eslogging"
          + "Environment"       = "prod"
          + "terraform-managed" = "true"
        }

      + advanced_security_options {
          + enabled                        = true
          + internal_user_database_enabled = true

          + master_user_options {
              + master_user_name     = "elastic"
              + master_user_password = (sensitive value)
            }
        }

      + auto_tune_options {
          + desired_state       = (known after apply)
          + rollback_on_disable = (known after apply)

          + maintenance_schedule {
              + cron_expression_for_recurrence = (known after apply)
              + start_at                       = (known after apply)

              + duration {
                  + unit  = (known after apply)
                  + value = (known after apply)
                }
            }
        }

      + cluster_config {
          + dedicated_master_enabled = false
          + instance_count           = 1
          + instance_type            = "t3.medium.elasticsearch"
          + zone_awareness_enabled   = false

          + cold_storage_options {
              + enabled = (known after apply)
            }
        }

      + domain_endpoint_options {
          + custom_endpoint                 = "logging.pick-bazar.store"
          + custom_endpoint_certificate_arn = "arn:aws:acm:us-east-1:630104760403:certificate/6d00a31d-2060-4efb-aa54-15f62d90aa42"
          + custom_endpoint_enabled         = true
          + enforce_https                   = true
          + tls_security_policy             = "Policy-Min-TLS-1-2-2019-07"
        }

      + ebs_options {
          + ebs_enabled = true
          + volume_size = 100
          + volume_type = "gp2"
        }

      + encrypt_at_rest {
          + enabled    = true
          + kms_key_id = (known after apply)
        }

      + node_to_node_encryption {
          + enabled = true
        }
    }

  # module.logging.aws_iam_policy.fb_policy will be created
  + resource "aws_iam_policy" "fb_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "fb_policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "es:ESHttp*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:es:us-east-1:630104760403:domain/eslogging"
                      + Sid      = "ESPolicy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.logging.aws_iam_role.irsa_fluentbit will be created
  + resource "aws_iam_role" "irsa_fluentbit" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/E0EB08E5B4A17173E3578E9738E413CC:sub" = "system:serviceaccount:logging:irsa-fluentbit"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::630104760403:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/E0EB08E5B4A17173E3578E9738E413CC"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "FluentbitRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.logging.aws_iam_role_policy_attachment.irsa_fluentbit will be created
  + resource "aws_iam_role_policy_attachment" "irsa_fluentbit" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "FluentbitRole"
    }

  # module.logging.aws_iam_service_linked_role.es will be created
  + resource "aws_iam_service_linked_role" "es" {
      + arn              = (known after apply)
      + aws_service_name = "es.amazonaws.com"
      + create_date      = (known after apply)
      + description      = "Allows Amazon ES to manage AWS resources for a domain on your behalf."
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + tags_all         = (known after apply)
      + unique_id        = (known after apply)
    }

  # module.logging.aws_route53_record.opensearch will be created
  + resource "aws_route53_record" "opensearch" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "logging"
      + records         = (known after apply)
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z03615011U2C8LAWZDOGP"
    }

  # module.logging.kubectl_manifest.fluentbit_yaml_apply[0] will be created
  + resource "kubectl_manifest" "fluentbit_yaml_apply" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.logging.kubectl_manifest.fluentbit_yaml_apply[1] will be created
  + resource "kubectl_manifest" "fluentbit_yaml_apply" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.logging.kubectl_manifest.fluentbit_yaml_apply[2] will be created
  + resource "kubectl_manifest" "fluentbit_yaml_apply" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.logging.kubectl_manifest.fluentbit_yaml_apply[3] will be created
  + resource "kubectl_manifest" "fluentbit_yaml_apply" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # module.logging.kubernetes_namespace_v1.logging will be created
  + resource "kubernetes_namespace_v1" "logging" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "logging"
            }
          + generation       = (known after apply)
          + name             = "logging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.logging.kubernetes_service_account.irsa_fluentbit will be created
  + resource "kubernetes_service_account" "irsa_fluentbit" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "irsa-fluentbit"
          + namespace        = "logging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.logging.null_resource.fluentbit-role will be created
  + resource "null_resource" "fluentbit-role" {
      + id       = (known after apply)
      + triggers = {
          + "endpoint" = (known after apply)
        }
    }

  # module.monitoring.data.kubernetes_ingress.grafana will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_ingress" "grafana" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "grafana"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.monitoring.aws_route53_record.grafana will be created
  + resource "aws_route53_record" "grafana" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "monitoring"
      + records         = (known after apply)
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z03615011U2C8LAWZDOGP"
    }

  # module.monitoring.helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = true
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                rbac:
                  create: true
                  ## Use an existing ClusterRole/Role (depending on rbac.namespaced false/true)
                  # useExistingRole: name-of-some-(cluster)role
                  pspEnabled: false
                  pspUseAppArmor: false
                  namespaced: false
                  extraRoleRules: []
                  # - apiGroups: []
                  #   resources: []
                  #   verbs: []
                  extraClusterRoleRules: []
                  # - apiGroups: []
                  #   resources: []
                  #   verbs: []
                serviceAccount:
                  create: true
                  name:
                  nameTest:
                #  annotations:
                #    eks.amazonaws.com/role-arn: arn:aws:iam::123456789000:role/iam-role-name-here
                  autoMount: true
                
                replicas: 1
                
                ## Create a headless service for the deployment
                headlessService: false
                
                ## Create HorizontalPodAutoscaler object for deployment type
                #
                autoscaling:
                  enabled: false
                #   minReplicas: 1
                #   maxReplicas: 10
                #   metrics:
                #   - type: Resource
                #     resource:
                #       name: cpu
                #       targetAverageUtilization: 60
                #   - type: Resource
                #     resource:
                #       name: memory
                #       targetAverageUtilization: 60
                
                ## See `kubectl explain poddisruptionbudget.spec` for more
                ## ref: https://kubernetes.io/docs/tasks/run-application/configure-pdb/
                podDisruptionBudget: {}
                #  minAvailable: 1
                #  maxUnavailable: 1
                
                ## See `kubectl explain deployment.spec.strategy` for more
                ## ref: https://kubernetes.io/docs/concepts/workloads/controllers/deployment/#strategy
                deploymentStrategy:
                  type: RollingUpdate
                
                readinessProbe:
                  httpGet:
                    path: /api/health
                    port: 3000
                
                livenessProbe:
                  httpGet:
                    path: /api/health
                    port: 3000
                  initialDelaySeconds: 60
                  timeoutSeconds: 30
                  failureThreshold: 10
                
                ## Use an alternate scheduler, e.g. "stork".
                ## ref: https://kubernetes.io/docs/tasks/administer-cluster/configure-multiple-schedulers/
                ##
                # schedulerName: "default-scheduler"
                
                image:
                  repository: grafana/grafana
                  tag: 8.4.6
                  sha: ""
                  pullPolicy: IfNotPresent
                
                  ## Optionally specify an array of imagePullSecrets.
                  ## Secrets must be manually created in the namespace.
                  ## ref: https://kubernetes.io/docs/tasks/configure-pod-container/pull-image-private-registry/
                  ##
                  # pullSecrets:
                  #   - myRegistrKeySecretName
                
                testFramework:
                  enabled: true
                  image: "bats/bats"
                  tag: "v1.4.1"
                  imagePullPolicy: IfNotPresent
                  securityContext: {}
                
                securityContext:
                  runAsUser: 472
                  runAsGroup: 472
                  fsGroup: 472
                
                containerSecurityContext:
                  {}
                
                extraConfigmapMounts: []
                  # - name: certs-configmap
                  #   mountPath: /etc/grafana/ssl/
                  #   subPath: certificates.crt # (optional)
                  #   configMap: certs-configmap
                  #   readOnly: true
                
                
                extraEmptyDirMounts: []
                  # - name: provisioning-notifiers
                  #   mountPath: /etc/grafana/provisioning/notifiers
                
                
                # Apply extra labels to common labels.
                extraLabels: {}
                
                ## Assign a PriorityClassName to pods if set
                # priorityClassName:
                
                downloadDashboardsImage:
                  repository: curlimages/curl
                  tag: 7.73.0
                  sha: ""
                  pullPolicy: IfNotPresent
                
                downloadDashboards:
                  env: {}
                  envFromSecret: ""
                  resources: {}
                
                ## Pod Annotations
                # podAnnotations: {}
                
                ## Pod Labels
                # podLabels: {}
                
                podPortName: grafana
                
                ## Deployment annotations
                # annotations: {}
                
                ## Expose the grafana service to be accessed from outside the cluster (LoadBalancer service).
                ## or access it from within the cluster (ClusterIP service). Set the service type and the port to serve it.
                ## ref: http://kubernetes.io/docs/user-guide/services/
                ##
                service:
                  enabled: true
                  type: ClusterIP
                  port: 80
                  targetPort: 3000
                    # targetPort: 4181 To be used with a proxy extraContainer
                  annotations: {}
                  labels: {}
                  portName: service
                
                serviceMonitor:
                  ## If true, a ServiceMonitor CRD is created for a prometheus operator
                  ## https://github.com/coreos/prometheus-operator
                  ##
                  enabled: false
                  path: /metrics
                  #  namespace: monitoring  (defaults to use the namespace this chart is deployed to)
                  labels: {}
                  interval: 1m
                  scheme: http
                  tlsConfig: {}
                  scrapeTimeout: 30s
                  relabelings: []
                
                extraExposePorts: []
                 # - name: keycloak
                 #   port: 8080
                 #   targetPort: 8080
                 #   type: ClusterIP
                
                # overrides pod.spec.hostAliases in the grafana deployment's pods
                hostAliases: []
                  # - ip: "1.2.3.4"
                  #   hostnames:
                  #     - "my.host.com"
                
                ingress:
                  enabled: true
                  # For Kubernetes >= 1.18 you should specify the ingress-controller via the field ingressClassName
                  # See https://kubernetes.io/blog/2020/04/02/improvements-to-the-ingress-api-in-kubernetes-1.18/#specifying-the-class-of-an-ingress
                  # ingressClassName: nginx
                  # Values can be templated
                  annotations: 
                    kubernetes.io/ingress.class : alb
                    alb.ingress.kubernetes.io/scheme : "internet-facing"
                    alb.ingress.kubernetes.io/target-type : "ip"
                    alb.ingress.kubernetes.io/certificate-arn : arn:aws:acm:us-east-1:630104760403:certificate/6d00a31d-2060-4efb-aa54-15f62d90aa42
                    alb.ingress.kubernetes.io/listen-ports : "[{\"HTTP\": 80}, {\"HTTPS\":443}]"
                    alb.ingress.kubernetes.io/actions.ssl-redirect : "{\"Type\": \"redirect\", \"RedirectConfig\": { \"Protocol\": \"HTTPS\", \"Port\": \"443\", \"StatusCode\": \"HTTP_301\"}}"
                    alb.ingress.kubernetes.io/group.name : "gitops"
                  labels: {}
                  path: /
                
                  # pathType is only for k8s >= 1.1=
                  pathType: Prefix
                
                  hosts:
                    - monitoring.pick-bazar.store
                  ## Extra paths to prepend to every host configuration. This is useful when working with annotation based services.
                  extraPaths: 
                  - path: /
                    pathType: Prefix
                    backend:
                      service:
                        name: ssl-redirect
                        port:
                          name: use-annotation
                
                
                  tls: []
                  #  - secretName: chart-example-tls
                  #    hosts:
                  #      - chart-example.local
                
                resources: 
                 limits:
                   cpu: 100m
                   memory: 128Mi
                 requests:
                   cpu: 100m
                   memory: 128Mi
                
                ## Node labels for pod assignment
                ## ref: https://kubernetes.io/docs/user-guide/node-selection/
                #
                nodeSelector: {}
                
                ## Tolerations for pod assignment
                ## ref: https://kubernetes.io/docs/concepts/configuration/taint-and-toleration/
                ##
                tolerations: []
                
                ## Affinity for pod assignment
                ## ref: https://kubernetes.io/docs/concepts/configuration/assign-pod-node/#affinity-and-anti-affinity
                ##
                affinity: {}
                
                ## Additional init containers (evaluated as template)
                ## ref: https://kubernetes.io/docs/concepts/workloads/pods/init-containers/
                ##
                extraInitContainers: []
                
                ## Enable an Specify container in extraContainers. This is meant to allow adding an authentication proxy to a grafana pod
                extraContainers: ""
                # extraContainers: |
                # - name: proxy
                #   image: quay.io/gambol99/keycloak-proxy:latest
                #   args:
                #   - -provider=github
                #   - -client-id=
                #   - -client-secret=
                #   - -github-org=<ORG_NAME>
                #   - -email-domain=*
                #   - -cookie-secret=
                #   - -http-address=http://0.0.0.0:4181
                #   - -upstream-url=http://127.0.0.1:3000
                #   ports:
                #     - name: proxy-web
                #       containerPort: 4181
                
                ## Volumes that can be used in init containers that will not be mounted to deployment pods
                extraContainerVolumes: []
                #  - name: volume-from-secret
                #    secret:
                #      secretName: secret-to-mount
                #  - name: empty-dir-volume
                #    emptyDir: {}
                
                ## Enable persistence using Persistent Volume Claims
                ## ref: http://kubernetes.io/docs/user-guide/persistent-volumes/
                ##
                persistence:
                  type: pvc
                  enabled: false
                  storageClassName: "gp2"
                  accessModes:
                    - ReadWriteOnce
                  size: 10Gi
                  # annotations: {}
                  # finalizers:
                  #   - kubernetes.io/pvc-protection
                  # selectorLabels: {}
                  # subPath: ""
                  # existingClaim:
                
                  ## If persistence is not enabled, this allows to mount the
                  ## local storage in-memory to improve performance
                  ##
                  inMemory:
                    enabled: false
                    ## The maximum usage on memory medium EmptyDir would be
                    ## the minimum value between the SizeLimit specified
                    ## here and the sum of memory limits of all containers in a pod
                    ##
                    # sizeLimit: 300Mi
                
                initChownData:
                  ## If false, data ownership will not be reset at startup
                  ## This allows the prometheus-server to be run with an arbitrary user
                  ##
                  enabled: false
                
                  ## initChownData container image
                  ##
                  image:
                    repository: busybox
                    tag: "1.31.1"
                    sha: ""
                    pullPolicy: IfNotPresent
                
                  ## initChownData resource requests and limits
                  ## Ref: http://kubernetes.io/docs/user-guide/compute-resources/
                  ##
                  resources: {}
                  #  limits:
                  #    cpu: 100m
                  #    memory: 128Mi
                  #  requests:
                  #    cpu: 100m
                  #    memory: 128Mi
                
                
                # Administrator credentials when not using an existing secret (see below)
                adminUser: grafana
                adminPassword: Gr@fAna123
                
                # Use an existing secret for the admin user.
                admin:
                  existingSecret: ""
                  userKey: admin-user
                  passwordKey: admin-password
                
                ## Define command to be executed at startup by grafana container
                ## Needed if using `vault-env` to manage secrets (ref: https://banzaicloud.com/blog/inject-secrets-into-pods-vault/)
                ## Default is "run.sh" as defined in grafana's Dockerfile
                # command:
                # - "sh"
                # - "/run.sh"
                
                ## Use an alternate scheduler, e.g. "stork".
                ## ref: https://kubernetes.io/docs/tasks/administer-cluster/configure-multiple-schedulers/
                ##
                # schedulerName:
                
                ## Extra environment variables that will be pass onto deployment pods
                ##
                ## to provide grafana with access to CloudWatch on AWS EKS:
                ## 1. create an iam role of type "Web identity" with provider oidc.eks.* (note the provider for later)
                ## 2. edit the "Trust relationships" of the role, add a line inside the StringEquals clause using the
                ## same oidc eks provider as noted before (same as the existing line)
                ## also, replace NAMESPACE and prometheus-operator-grafana with the service account namespace and name
                ##
                ##  "oidc.eks.us-east-1.amazonaws.com/id/XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX:sub": "system:serviceaccount:NAMESPACE:prometheus-operator-grafana",
                ##
                ## 3. attach a policy to the role, you can use a built in policy called CloudWatchReadOnlyAccess
                ## 4. use the following env: (replace 123456789000 and iam-role-name-here with your aws account number and role name)
                ##
                ## env:
                ##   AWS_ROLE_ARN: arn:aws:iam::123456789000:role/iam-role-name-here
                ##   AWS_WEB_IDENTITY_TOKEN_FILE: /var/run/secrets/eks.amazonaws.com/serviceaccount/token
                ##   AWS_REGION: us-east-1
                ##
                ## 5. uncomment the EKS section in extraSecretMounts: below
                ## 6. uncomment the annotation section in the serviceAccount: above
                ## make sure to replace arn:aws:iam::123456789000:role/iam-role-name-here with your role arn
                
                env: {}
                
                ## "valueFrom" environment variable references that will be added to deployment pods. Name is templated.
                ## ref: https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.19/#envvarsource-v1-core
                ## Renders in container spec as:
                ##   env:
                ##     ...
                ##     - name: <key>
                ##       valueFrom:
                ##         <value rendered as YAML>
                envValueFrom: {}
                  #  ENV_NAME:
                  #    configMapKeyRef:
                  #      name: configmap-name
                  #      key: value_key
                
                ## The name of a secret in the same kubernetes namespace which contain values to be added to the environment
                ## This can be useful for auth tokens, etc. Value is templated.
                envFromSecret: ""
                
                ## Sensible environment variables that will be rendered as new secret object
                ## This can be useful for auth tokens, etc
                envRenderSecret: {}
                
                ## The names of secrets in the same kubernetes namespace which contain values to be added to the environment
                ## Each entry should contain a name key, and can optionally specify whether the secret must be defined with an optional key.
                ## Name is templated.
                envFromSecrets: []
                ## - name: secret-name
                ##   optional: true
                
                ## The names of conifgmaps in the same kubernetes namespace which contain values to be added to the environment
                ## Each entry should contain a name key, and can optionally specify whether the configmap must be defined with an optional key.
                ## Name is templated.
                ## ref: https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.23/#configmapenvsource-v1-core
                envFromConfigMaps: []
                ## - name: configmap-name
                ##   optional: true
                
                # Inject Kubernetes services as environment variables.
                # See https://kubernetes.io/docs/concepts/services-networking/connect-applications-service/#environment-variables
                enableServiceLinks: true
                
                ## Additional grafana server secret mounts
                # Defines additional mounts with secrets. Secrets must be manually created in the namespace.
                extraSecretMounts: []
                  # - name: secret-files
                  #   mountPath: /etc/secrets
                  #   secretName: grafana-secret-files
                  #   readOnly: true
                  #   subPath: ""
                  #
                  # for AWS EKS (cloudwatch) use the following (see also instruction in env: above)
                  # - name: aws-iam-token
                  #   mountPath: /var/run/secrets/eks.amazonaws.com/serviceaccount
                  #   readOnly: true
                  #   projected:
                  #     defaultMode: 420
                  #     sources:
                  #       - serviceAccountToken:
                  #           audience: sts.amazonaws.com
                  #           expirationSeconds: 86400
                  #           path: token
                  #
                  # for CSI e.g. Azure Key Vault use the following
                  # - name: secrets-store-inline
                  #  mountPath: /run/secrets
                  #  readOnly: true
                  #  csi:
                  #    driver: secrets-store.csi.k8s.io
                  #    readOnly: true
                  #    volumeAttributes:
                  #      secretProviderClass: "akv-grafana-spc"
                  #    nodePublishSecretRef:                       # Only required when using service principal mode
                  #       name: grafana-akv-creds                  # Only required when using service principal mode
                
                ## Additional grafana server volume mounts
                # Defines additional volume mounts.
                extraVolumeMounts: []
                  # - name: extra-volume-0
                  #   mountPath: /mnt/volume0
                  #   readOnly: true
                  #   existingClaim: volume-claim
                  # - name: extra-volume-1
                  #   mountPath: /mnt/volume1
                  #   readOnly: true
                  #   hostPath: /usr/shared/
                
                ## Pass the plugins you want installed as a list.
                ##
                plugins: []
                  # - digrich-bubblechart-panel
                  # - grafana-clock-panel
                
                ## Configure grafana datasources
                ## ref: http://docs.grafana.org/administration/provisioning/#datasources
                ##
                datasources:
                  datasources.yaml:
                    apiVersion: 1
                    datasources:
                    - name: Prometheus
                      type: prometheus
                      url: http://prometheus-server.monitoring.svc.cluster.local
                      access: proxy
                      isDefault: true
                
                ## Configure notifiers
                ## ref: http://docs.grafana.org/administration/provisioning/#alert-notification-channels
                ##
                notifiers: {}
                #  notifiers.yaml:
                #    notifiers:
                #    - name: email-notifier
                #      type: email
                #      uid: email1
                #      # either:
                #      org_id: 1
                #      # or
                #      org_name: Main Org.
                #      is_default: true
                #      settings:
                #        addresses: an_email_address@example.com
                #    delete_notifiers:
                
                ## Configure grafana dashboard providers
                ## ref: http://docs.grafana.org/administration/provisioning/#dashboards
                ##
                ## `path` must be /var/lib/grafana/dashboards/<provider_name>
                ##
                dashboardProviders: {}
                #  dashboardproviders.yaml:
                #    apiVersion: 1
                #    providers:
                #    - name: 'default'
                #      orgId: 1
                #      folder: ''
                #      type: file
                #      disableDeletion: false
                #      editable: true
                #      options:
                #        path: /var/lib/grafana/dashboards/default
                
                ## Configure grafana dashboard to import
                ## NOTE: To use dashboards you must also enable/configure dashboardProviders
                ## ref: https://grafana.com/dashboards
                ##
                ## dashboards per provider, use provider name as key.
                ##
                dashboards: {}
                  # default:
                  #   some-dashboard:
                  #     json: |
                  #       $RAW_JSON
                  #   custom-dashboard:
                  #     file: dashboards/custom-dashboard.json
                  #   prometheus-stats:
                  #     gnetId: 2
                  #     revision: 2
                  #     datasource: Prometheus
                  #   local-dashboard:
                  #     url: https://example.com/repository/test.json
                  #     token: ''
                  #   local-dashboard-base64:
                  #     url: https://example.com/repository/test-b64.json
                  #     token: ''
                  #     b64content: true
                
                ## Reference to external ConfigMap per provider. Use provider name as key and ConfigMap name as value.
                ## A provider dashboards must be defined either by external ConfigMaps or in values.yaml, not in both.
                ## ConfigMap data example:
                ##
                ## data:
                ##   example-dashboard.json: |
                ##     RAW_JSON
                ##
                dashboardsConfigMaps: {}
                #  default: ""
                
                ## Grafana's primary configuration
                ## NOTE: values in map will be converted to ini format
                ## ref: http://docs.grafana.org/installation/configuration/
                ##
                grafana.ini:
                  paths:
                    data: /var/lib/grafana/
                    logs: /var/log/grafana
                    plugins: /var/lib/grafana/plugins
                    provisioning: /etc/grafana/provisioning
                  analytics:
                    check_for_updates: true
                  log:
                    mode: console
                  grafana_net:
                    url: https://grafana.net
                ## grafana Authentication can be enabled with the following values on grafana.ini
                 # server:
                      # The full public facing url you use in browser, used for redirects and emails
                 #    root_url:
                 # https://grafana.com/docs/grafana/latest/auth/github/#enable-github-in-grafana
                 # auth.github:
                 #    enabled: false
                 #    allow_sign_up: false
                 #    scopes: user:email,read:org
                 #    auth_url: https://github.com/login/oauth/authorize
                 #    token_url: https://github.com/login/oauth/access_token
                 #    api_url: https://api.github.com/user
                 #    team_ids:
                 #    allowed_organizations:
                 #    client_id:
                 #    client_secret:
                ## LDAP Authentication can be enabled with the following values on grafana.ini
                ## NOTE: Grafana will fail to start if the value for ldap.toml is invalid
                  # auth.ldap:
                  #   enabled: true
                  #   allow_sign_up: true
                  #   config_file: /etc/grafana/ldap.toml
                
                ## Grafana's LDAP configuration
                ## Templated by the template in _helpers.tpl
                ## NOTE: To enable the grafana.ini must be configured with auth.ldap.enabled
                ## ref: http://docs.grafana.org/installation/configuration/#auth-ldap
                ## ref: http://docs.grafana.org/installation/ldap/#configuration
                ldap:
                  enabled: false
                  # `existingSecret` is a reference to an existing secret containing the ldap configuration
                  # for Grafana in a key `ldap-toml`.
                  existingSecret: ""
                  # `config` is the content of `ldap.toml` that will be stored in the created secret
                  config: ""
                  # config: |-
                  #   verbose_logging = true
                
                  #   [[servers]]
                  #   host = "my-ldap-server"
                  #   port = 636
                  #   use_ssl = true
                  #   start_tls = false
                  #   ssl_skip_verify = false
                  #   bind_dn = "uid=%s,ou=users,dc=myorg,dc=com"
                
                ## Grafana's SMTP configuration
                ## NOTE: To enable, grafana.ini must be configured with smtp.enabled
                ## ref: http://docs.grafana.org/installation/configuration/#smtp
                smtp:
                  # `existingSecret` is a reference to an existing secret containing the smtp configuration
                  # for Grafana.
                  existingSecret: ""
                  userKey: "user"
                  passwordKey: "password"
                
                ## Sidecars that collect the configmaps with specified label and stores the included files them into the respective folders
                ## Requires at least Grafana 5 to work and can't be used together with parameters dashboardProviders, datasources and dashboards
                sidecar:
                  image:
                    repository: quay.io/kiwigrid/k8s-sidecar
                    tag: 1.15.6
                    sha: ""
                  imagePullPolicy: IfNotPresent
                  resources: {}
                #   limits:
                #     cpu: 100m
                #     memory: 100Mi
                #   requests:
                #     cpu: 50m
                #     memory: 50Mi
                  securityContext: {}
                  # skipTlsVerify Set to true to skip tls verification for kube api calls
                  # skipTlsVerify: true
                  enableUniqueFilenames: false
                  dashboards:
                    enabled: false
                    SCProvider: true
                    # label that the configmaps with dashboards are marked with
                    label: grafana_dashboard
                    # value of label that the configmaps with dashboards are set to
                    labelValue: null
                    # folder in the pod that should hold the collected dashboards (unless `defaultFolderName` is set)
                    folder: /tmp/dashboards
                    # The default folder name, it will create a subfolder under the `folder` and put dashboards in there instead
                    defaultFolderName: null
                    # Namespaces list. If specified, the sidecar will search for config-maps/secrets inside these namespaces.
                    # Otherwise the namespace in which the sidecar is running will be used.
                    # It's also possible to specify ALL to search in all namespaces.
                    searchNamespace: null
                    # Method to use to detect ConfigMap changes. With WATCH the sidecar will do a WATCH requests, with SLEEP it will list all ConfigMaps, then sleep for 60 seconds.
                    watchMethod: WATCH
                    # search in configmap, secret or both
                    resource: both
                    # If specified, the sidecar will look for annotation with this name to create folder and put graph here.
                    # You can use this parameter together with `provider.foldersFromFilesStructure`to annotate configmaps and create folder structure.
                    folderAnnotation: null
                    # Absolute path to shell script to execute after a configmap got reloaded
                    script: null
                    # watchServerTimeout: request to the server, asking it to cleanly close the connection after that.
                    # defaults to 60sec; much higher values like 3600 seconds (1h) are feasible for non-Azure K8S
                    # watchServerTimeout: 3600
                    #
                    # watchClientTimeout: is a client-side timeout, configuring your local socket.
                    # If you have a network outage dropping all packets with no RST/FIN,
                    # this is how long your client waits before realizing & dropping the connection.
                    # defaults to 66sec (sic!)
                    # watchClientTimeout: 60
                    #
                    # provider configuration that lets grafana manage the dashboards
                    provider:
                      # name of the provider, should be unique
                      name: sidecarProvider
                      # orgid as configured in grafana
                      orgid: 1
                      # folder in which the dashboards should be imported in grafana
                      folder: ''
                      # type of the provider
                      type: file
                      # disableDelete to activate a import-only behaviour
                      disableDelete: false
                      # allow updating provisioned dashboards from the UI
                      allowUiUpdates: false
                      # allow Grafana to replicate dashboard structure from filesystem
                      foldersFromFilesStructure: false
                    # Additional dashboard sidecar volume mounts
                    extraMounts: []
                  datasources:
                    enabled: false
                    # label that the configmaps with datasources are marked with
                    label: grafana_datasource
                    # value of label that the configmaps with datasources are set to
                    labelValue: null
                    # If specified, the sidecar will search for datasource config-maps inside this namespace.
                    # Otherwise the namespace in which the sidecar is running will be used.
                    # It's also possible to specify ALL to search in all namespaces
                    searchNamespace: null
                    # Method to use to detect ConfigMap changes. With WATCH the sidecar will do a WATCH requests, with SLEEP it will list all ConfigMaps, then sleep for 60 seconds.
                    watchMethod: WATCH
                    # search in configmap, secret or both
                    resource: both
                    # Endpoint to send request to reload datasources
                    reloadURL: "http://localhost:3000/api/admin/provisioning/datasources/reload"
                    skipReload: false
                    # Deploy the datasource sidecar as an initContainer in addition to a container.
                    # This is needed if skipReload is true, to load any datasources defined at startup time.
                    initDatasources: false
                  plugins:
                    enabled: false
                    # label that the configmaps with plugins are marked with
                    label: grafana_plugin
                    # value of label that the configmaps with plugins are set to
                    labelValue: null
                    # If specified, the sidecar will search for plugin config-maps inside this namespace.
                    # Otherwise the namespace in which the sidecar is running will be used.
                    # It's also possible to specify ALL to search in all namespaces
                    searchNamespace: null
                    # Method to use to detect ConfigMap changes. With WATCH the sidecar will do a WATCH requests, with SLEEP it will list all ConfigMaps, then sleep for 60 seconds.
                    watchMethod: WATCH
                    # search in configmap, secret or both
                    resource: both
                    # Endpoint to send request to reload plugins
                    reloadURL: "http://localhost:3000/api/admin/provisioning/plugins/reload"
                    skipReload: false
                    # Deploy the datasource sidecar as an initContainer in addition to a container.
                    # This is needed if skipReload is true, to load any plugins defined at startup time.
                    initPlugins: false
                  notifiers:
                    enabled: false
                    # label that the configmaps with notifiers are marked with
                    label: grafana_notifier
                    # If specified, the sidecar will search for notifier config-maps inside this namespace.
                    # Otherwise the namespace in which the sidecar is running will be used.
                    # It's also possible to specify ALL to search in all namespaces
                    searchNamespace: null
                    # search in configmap, secret or both
                    resource: both
                
                ## Override the deployment namespace
                ##
                namespaceOverride: ""
                
                ## Number of old ReplicaSets to retain
                ##
                revisionHistoryLimit: 10
                
                ## Add a seperate remote image renderer deployment/service
                imageRenderer:
                  # Enable the image-renderer deployment & service
                  enabled: false
                  replicas: 1
                  image:
                    # image-renderer Image repository
                    repository: grafana/grafana-image-renderer
                    # image-renderer Image tag
                    tag: latest
                    # image-renderer Image sha (optional)
                    sha: ""
                    # image-renderer ImagePullPolicy
                    pullPolicy: Always
                  # extra environment variables
                  env:
                    HTTP_HOST: "0.0.0.0"
                    # RENDERING_ARGS: --no-sandbox,--disable-gpu,--window-size=1280x758
                    # RENDERING_MODE: clustered
                    # IGNORE_HTTPS_ERRORS: true
                  # image-renderer deployment serviceAccount
                  serviceAccountName: ""
                  # image-renderer deployment securityContext
                  securityContext: {}
                  # image-renderer deployment Host Aliases
                  hostAliases: []
                  # image-renderer deployment priority class
                  priorityClassName: ''
                  service:
                    # Enable the image-renderer service
                    enabled: true
                    # image-renderer service port name
                    portName: 'http'
                    # image-renderer service port used by both service and deployment
                    port: 8081
                    targetPort: 8081
                  # If https is enabled in Grafana, this needs to be set as 'https' to correctly configure the callback used in Grafana
                  grafanaProtocol: http
                  # In case a sub_path is used this needs to be added to the image renderer callback
                  grafanaSubPath: ""
                  # name of the image-renderer port on the pod
                  podPortName: http
                  # number of image-renderer replica sets to keep
                  revisionHistoryLimit: 10
                  networkPolicy:
                    # Enable a NetworkPolicy to limit inbound traffic to only the created grafana pods
                    limitIngress: true
                    # Enable a NetworkPolicy to limit outbound traffic to only the created grafana pods
                    limitEgress: false
                  resources: {}
                #   limits:
                #     cpu: 100m
                #     memory: 100Mi
                #   requests:
                #     cpu: 50m
                #     memory: 50Mi
                
                networkPolicy:
                  ## @param networkPolicy.enabled Enable creation of NetworkPolicy resources. Only Ingress traffic is filtered for now.
                  ##
                  enabled: false
                  ## @param networkPolicy.allowExternal Don't require client label for connections
                  ## The Policy model to apply. When set to false, only pods with the correct
                  ## client label will have network access to  grafana port defined.
                  ## When true, grafana will accept connections from any source
                  ## (with the correct destination port).
                  ##
                  allowExternal: true
                  ## @param networkPolicy.explicitNamespacesSelector A Kubernetes LabelSelector to explicitly select namespaces from which traffic could be allowed
                  ## If explicitNamespacesSelector is missing or set to {}, only client Pods that are in the networkPolicy's namespace
                  ## and that match other criteria, the ones that have the good label, can reach the grafana.
                  ## But sometimes, we want the grafana to be accessible to clients from other namespaces, in this case, we can use this
                  ## LabelSelector to select these namespaces, note that the networkPolicy's namespace should also be explicitly added.
                  ##
                  ## Example:
                  ## explicitNamespacesSelector:
                  ##   matchLabels:
                  ##     role: frontend
                  ##   matchExpressions:
                  ##    - {key: role, operator: In, values: [frontend]}
                  ##
                  explicitNamespacesSelector: {}
                
                # Enable backward compatibility of kubernetes where version below 1.13 doesn't have the enableServiceLinks option
                enableKubeBackwardCompatibility: false
                
                # Create a dynamic manifests via values:
                extraObjects: []
                  # - apiVersion: "kubernetes-client.io/v1"
                  #   kind: ExternalSecret
                  #   metadata:
                  #     name: grafana-secrets
                  #   spec:
                  #     backendType: gcpSecretsManager
                  #     data:
                  #       - key: grafana-admin-password
                  #         name: adminPassword
            EOT,
        ]
      + verify                     = false
      + version                    = "6.26.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.monitoring.helm_release.metrics-server will be created
  + resource "helm_release" "metrics-server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = true
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "3.8.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.monitoring.helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "prometheus"
      + cleanup_on_fail            = true
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "15.8.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "alertmanager.persistentVolume.storageClass"
          + value = "gp2"
        }
      + set {
          + name  = "server.persistentVolume.storageClass"
          + value = "gp2"
        }
    }

  # module.monitoring.kubernetes_namespace_v1.monitoring will be created
  + resource "kubernetes_namespace_v1" "monitoring" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "monitoring"
            }
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 25 to add, 2 to change, 0 to destroy.
╷
│ Warning: Redundant ignore_changes element
│ 
│   on .terraform/modules/pgsql/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
│   26: resource "aws_db_instance" "this" {
│ 
│ Adding an attribute name to ignore_changes tells Terraform to ignore future
│ changes to the argument in configuration after the object has been created,
│ retaining the value originally configured.
│ 
│ The attribute latest_restorable_time is decided by the provider alone and
│ therefore there can be no configured value to compare with. Including this
│ attribute in ignore_changes has no effect. Remove the attribute from
│ ignore_changes to quiet this warning.
╵
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/pgsql/modules/db_instance/outputs.tf line 63, in output "db_instance_name":
│   63:   value       = try(aws_db_instance.this[0].name, "")
│ 
│ The attribute "name" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and one more similar warning elsewhere)
╵

</details>

*Pusher: @quanganhquanganh, Action: `pull_request`*